# Cable Size Ground Conductor Size Property

Source: https://www.revitapidocs.com/2026/ed921131-ad11-0d17-ea99-dae1a4acebdf.htm

---

| Cable Size Ground Conductor Size Property |
| --- |

The size of a Ground Conductor.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId GroundConductorSize { get; set; }
```

```
Public Property GroundConductorSize As ElementId
	Get
	Set
```

```
public:
property ElementId^ GroundConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member GroundConductorSize : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Conductor Size id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

Remarks Each Ground Conductor has the same size. See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace